{
  "blogs": [
    {
      "title": "Periodt.",
      "body": "Why is it always \"someone has it worse\" and not \"it's okay to feel like that, it's gonna be okay\"? Even though both won't help, the first can make that person feel worse. First of all, this is not a fucking competition of who's having it worse. Everyone's got their struggles, and all of them are valid. You'd never know how they've been fighting, and how much it did terrible to them.\nYou can make them feel seen so that they can keep going, or leave. Sometimes your silence can help, I swear. If you can't be kind, you can do nothing instead of passing such comments. Thank you :)\nTo everyone battling their demons, you're loved, you're seen, and I'm proud of you because you've made it to here.\nLive and let live.",
      "id": 1,
      "date": "28 December 2022"
    },
    {
      "title": "Not a fucking poem.",
      "body": "I've seen people pulling me down when trying to achieve\njealous when I achieved\nlaughing when I was going through my downfall\n\nI've seen people using me when I was the happy fun person\nabandoning me when I stopped being the fun person\n\nI've seen people barging into my space when I didn't care about\ngetting mad at me when I started taking up\n\nI've seen people exploiting my niceness\nusing them as their emotional support\nBecome blindfolded when I needed the same\n\nI've seen people being seen by me\nUnseen when I wanted to be\n\nThis is not a fucking poem\nThis is the blood I lost\nGetting sucked by people \nwho took me granted ",
      "id": 2,
      "date": "24 January 2023"
    },
    {
      "title": "Dear Amma,",
      "body": "First of all, happiest birthday to you! You've been my first best friend in my life. I couldn't stop sharing things with you. From the little cat I saw on my way to school to the class fights, I'm eager to get home just to tell you the whole story.\nYou've been always good at spotting fake friends, and sometimes their intentions too. We had arguments on that and at the end of the day, you were always right. I always love to be with you and share those smallest things. \nYou've always been the coolest among moms, but actually Amma, you're something different. Okay I'd sometimes call you cool, because you're cool when you're. And the other time, you lose your cool at times. Maybe it's just your mild possessiveness to keep your little girl from getting away from you. I love you for that, but Amma, nothing could be always someone's only belonging. You couldn't stop her from moving. She has got some emotions and cravings which are very much harmless. \nOkay you may ask what I'm lacking. Yeah, my parents are so loving. My mom is so caring and my dad is the coolest. But there are things which you couldn't provide. Okay lemme make it clear that, there are things you couldn't provide, as well as there are things ONLY you could provide. Noone else on earth could do that. \nAmma, we need everyone. We need space. Sometimes I'd crave for some space, which everyone needs. We need to feed our emotions. Everything. That's when we have fights, when you don't really understand what I need. But that's okay Amma, I know you're trying to learn. You'd get better, I'm happy with that.\nAmma, I might say that I'm fed up of staying home. I might say that I wanna live with someone else. See, everything is just temporary. \"This too shall pass.\" The whole world is running on these temporaries. \nBut Amma, I wanna let you know that I can't hate you. Ever. Don't worry, I'm safe in my own hands. I'm 20, and I'm somewhat old enough even though you think of me as a 10 yo. I'd always your little girl. Once again, happy birthday to youuuu! ",
      "id": 3,
      "date": "7 February 2021"
    }
  ]
}
